app/controllers/transformer_informations_controller.rb

  def index
    if request.xhr?
      if params[:region]
        debugger
        @stations = Station.find_all_by_region(params[:region])
        names = @stations.collect { |s| s.name }
        transformers = Transformer.find_all_by_transformer_name_initials(names)
        @data_points = TransformerInformation.get_data_points_by_transformers(transformers)
        @data_points = @data_points.to_json
      elsif params[:transformer_id]
        @data_points = TransformerInformation.get_data_points_by_transformer_id(params[:transformer_id])
        @data_points = @data_points.to_json
      else
        @data_points = TransformerInformation.get_data_points.to_json
      end
    else
      @transformer_informations = TransformerInformation.all
---
SELECT * FROM "transformer_informations"

  def show
    if request.xhr?

      @no_header = true
      @no_footer = true
    end
    @transformer_information = TransformerInformation.find(params[:id])
---
SELECT * FROM "transformer_informations" WHERE ("transformer_informations"."id" = 1)

  def create
    @transformer_information = TransformerInformation.new(params[:transformer_information])
    if @transformer_information.save
---
INSERT INTO "transformer_informations" ("created_at", "system_fault_level_hv", "application_use_id", "updated_at", "probability_of_force_outage_id", "system_location_id", "system_stability_id", "bus_voltage_hv_id", "bus_voltage_lv_id", "social_aspect_id", "public_image", "n1_criteria", "pollution_id", "system_fault_level_lv") VALUES('2010-09-01 11:23:21', NULL, NULL, '2010-09-01 11:23:21', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'yes', NULL, NULL)