app/controllers/transformers_controller.rb

        )
      end
    else
      @transformers = Transformer.order("id").all
---
SELECT * FROM "transformer" ORDER BY id

  def edit
    @transformer = Transformer.find(params[:id])
---
SELECT * FROM "transformer" WHERE ("transformer"."id" = 1)

  def update
    @transformer = Transformer.find(params[:id])
    @transformer.brand_id = params[:transformer][:brand_id]
    respond_to do |format|
      if @transformer.save!
---
SELECT * FROM "transformer" WHERE ("transformer"."id" = 1)
UPDATE "transformer" SET "brand_id" = 13 WHERE "id" = 3

  def show
    @transformer = Transformer.find(params[:id])
---
SELECT * FROM "transformer" WHERE ("transformer"."id" = 1)